Revit 2027 API
AreaLoad.Area Property
 Returns area of the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
public:
property double Area {
	double get ();
}
member Area : float with get
Property Value
Double
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace